## Q1: Replace all odd numbers in arr with -1 without changing arr
## arr = np.array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
## output array: [ 0 -1  2 -1  4 -1  6 -1  8 -1]

In [ ]:
# Q1: replacing odd number by -1
import numpy as np
arr = np.array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
print(arr)
arr[ arr%2 == 1] = -1
print(arr)

## Q2: Here is a numpy array:
## A= [[2, 7, 8, 2, 0, 7],
##       [2, 9, 0, 3, 4, 6],
##       [1, 9, 9, 8, 8, 4],
##       [2, 4, 1, 5, 3, 2]]
## Compute the mean value for each column

In [ ]:
# Q2: Compute the average for each column
A = np.array([[2, 7, 8, 2, 0, 7],
       [2, 9, 0, 3, 4, 6],
       [1, 9, 9, 8, 8, 4],
       [2, 4, 1, 5, 3, 2]])
np.mean(A, axis = 0)

## Q3: Here is a numpy array:
## A= [[2, 7, 8, 2, 0, 7],
##       [2, 9, 0, 3, 4, 6],
##       [1, 9, 9, 8, 8, 4],
##       [2, 4, 1, 5, 3, 2]]
## Print the maximum value for each row

In [ ]:
# Q3: Compute the average for each row
A = np.array([[2, 7, 8, 2, 0, 7],
       [2, 9, 0, 3, 4, 6],
       [1, 9, 9, 8, 8, 4],
       [2, 4, 1, 5, 3, 2]])
np.mean(A, axis = 1)

## What is Pandas?

From their website, 

> "pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language."

Pandas is built on top of ``numpy`` and is analogous to the ``tidyverse in R``. It has functions for easily reading in data from various formats, cleaning and manipulating data, and data analysis. Pandas dataframes and series are easy to interface with other packages for data modeling and visulization, like seaborn, scikitlearn, and matplotlib.

## Pandas allows you to:
- ### Define fundamental structures for working with data
- ### Endow them with methods that facilitate operations such as:
    - ### Reading in data
    - ### Adjusting indices
    - ### Working with dates and time series
    - ### Sorting, grouping, re-ordering and general data munging
    - ### Dealing with missing values, etc., etc.

In [1]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.rcParams["figure.figsize"] = [10,8]  # Set default figure size
import requests

## Two most-widely used data types defined by pandas are:
- ## ``Series``: a “column” of data, such as a collection of observations on a single variable 
- ## ``DataFrame``: an object for storing related columns of data

## Series:

In [2]:
# Start with series

s = pd.Series(np.random.randint(100, size = 5), name='Scores')
s

0    40
1    86
2    79
3    71
4    80
Name: Scores, dtype: int64

In [3]:
# perform arithmetic computation: be aware of the changes on data type!
print(s/100)
print(s**2)
print(np.sin(s))

0    0.40
1    0.86
2    0.79
3    0.71
4    0.80
Name: Scores, dtype: float64
0    1600
1    7396
2    6241
3    5041
4    6400
Name: Scores, dtype: int64
0    0.745113
1   -0.923458
2   -0.444113
3    0.951055
4   -0.993889
Name: Scores, dtype: float64

In [4]:
# Performing statistics on the Series
s = pd.Series(np.random.randint(100, size = 5), name='Scores')
print(s)
# Provide comprehensive statistics
print(s.describe()) 
# Other functions:
print("Mean is:",s.mean())
print("Standard Deviation is:", s.std())
print("Maximum value is:",s.max())

0    96
1    73
2    24
3    58
4    45
Name: Scores, dtype: int64
count     5.000000
mean     59.200000
std      27.325812
min      24.000000
25%      45.000000
50%      58.000000
75%      73.000000
max      96.000000
Name: Scores, dtype: float64
Mean is: 59.2
Standard Deviation is: 27.325811973297334
Maximum value is: 96

In [5]:
# Series allows a flexible definition of indexes
s.index = ['John','Jesse','Amanda','Yilin','Nino']
print(s)
print(s.describe())
print(s.reset_index(drop = True))

John      96
Jesse     73
Amanda    24
Yilin     58
Nino      45
Name: Scores, dtype: int64
count     5.000000
mean     59.200000
std      27.325812
min      24.000000
25%      45.000000
50%      58.000000
75%      73.000000
max      96.000000
Name: Scores, dtype: float64
0    96
1    73
2    24
3    58
4    45
Name: Scores, dtype: int64

In [8]:
# A testing case
s3 = pd.Series(['2','3',4,4,6], name = 'Scores', index = ['John','Jesse','Amanda','Yilin','Nino'])
print(s3)
print(s3.describe())

John      2
Jesse     3
Amanda    4
Yilin     4
Nino      6
Name: Scores, dtype: object
count     5
unique    4
top       4
freq      2
Name: Scores, dtype: int64

In [15]:
s = pd.Series([10,9,8,7,8], name = 'Scores', index = ['John','Jesse','Amanda','Yilin','Nino'])##
print(s)
# Data selection
print("\nData Selection:")
print(s['John'])
# Data replacement
print("\nData Replacement:")
s['John'] = 0
print(s)
# Data removal
print("\nData Removal:")
s1 = s.drop(index = ['John']) 
print(s1)
# Reset indexing
print("\nReset indexing")
s2 = s.reset_index(drop = True) 
print(s2)
# Other operations
print('John' in s1) # checking membership
print(s >= 8) # Boolean type array

John      10
Jesse      9
Amanda     8
Yilin      7
Nino       8
Name: Scores, dtype: int64

Data Selection:
10

Data Replacement:
John      0
Jesse     9
Amanda    8
Yilin     7
Nino      8
Name: Scores, dtype: int64

Data Removal:
Jesse     9
Amanda    8
Yilin     7
Nino      8
Name: Scores, dtype: int64

Reset indexing
0    0
1    9
2    8
3    7
4    8
Name: Scores, dtype: int64
False
John      False
Jesse      True
Amanda     True
Yilin     False
Nino       True
Name: Scores, dtype: bool

## Dataframes:
Pandas supports reading csv, excel, txt, xml, json, pickle and others. It can also read in data from SQL databases directly. 
An example with csv data below.

## Reading in Data

In [16]:
df = pd.read_csv('test_pwt.csv')
df
#df.shape

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

## Accessing Columns and Rows

In [17]:
# We can select particular rows using standard Python array slicing notation
df[2:5]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954

In [18]:
# To select columns, we can pass a list containing the names of the desired columns
#represented as strings
df[['country', 'tcgdp']]

         country         tcgdp
0      Argentina  2.950722e+05
1      Australia  5.418047e+05
2          India  1.728144e+06
3         Israel  1.292539e+05
4         Malawi  5.026222e+03
5   South Africa  2.272424e+05
6  United States  9.898700e+06
7        Uruguay  2.525596e+04

In [19]:
# To select both rows and columns using integers, 
# the iloc attribute should be used with the format .iloc[rows, columns]
df.iloc[2:5, 0:4]

  country country isocode  year          POP
2   India             IND  2000  1006300.297
3  Israel             ISR  2000     6114.570
4  Malawi             MWI  2000    11801.505

In [20]:
# select some columns
df.loc[df.index[2:5], ['country', 'tcgdp']]

  country         tcgdp
2   India  1.728144e+06
3  Israel  1.292539e+05
4  Malawi  5.026222e+03

In [21]:
# You can truncate the previous table and copy it to a new data frame. 
df_new = df[['country', 'POP', 'tcgdp']]
df_new

         country          POP         tcgdp
0      Argentina    37335.653  2.950722e+05
1      Australia    19053.186  5.418047e+05
2          India  1006300.297  1.728144e+06
3         Israel     6114.570  1.292539e+05
4         Malawi    11801.505  5.026222e+03
5   South Africa    45064.098  2.272424e+05
6  United States   282171.957  9.898700e+06
7        Uruguay     3219.793  2.525596e+04

In [22]:
# 0 to 7 seems redundant
df_new = df_new.set_index('country')
print(df_new)

                       POP         tcgdp
country
Argentina        37335.653  2.950722e+05
Australia        19053.186  5.418047e+05
India          1006300.297  1.728144e+06
Israel            6114.570  1.292539e+05
Malawi           11801.505  5.026222e+03
South Africa     45064.098  2.272424e+05
United States   282171.957  9.898700e+06
Uruguay           3219.793  2.525596e+04

In [23]:
# But what is tcgdp?
# Let's change the title!
df_new.columns = 'population', 'total GDP'
print(df_new)

                population     total GDP
country
Argentina        37335.653  2.950722e+05
Australia        19053.186  5.418047e+05
India          1006300.297  1.728144e+06
Israel            6114.570  1.292539e+05
Malawi           11801.505  5.026222e+03
South Africa     45064.098  2.272424e+05
United States   282171.957  9.898700e+06
Uruguay           3219.793  2.525596e+04

In [24]:
# Population is in thousands, let’s revert to single units
df_new['population'] = df_new['population'] * 1e3
df_new

                 population     total GDP
country
Argentina      3.733565e+07  2.950722e+05
Australia      1.905319e+07  5.418047e+05
India          1.006300e+09  1.728144e+06
Israel         6.114570e+06  1.292539e+05
Malawi         1.180150e+07  5.026222e+03
South Africa   4.506410e+07  2.272424e+05
United States  2.821720e+08  9.898700e+06
Uruguay        3.219793e+06  2.525596e+04

In [25]:
# Next, we’re going to ADD a column showing real GDP per individual, 
# multiplying by 1,000,000 as we go because total GDP is in millions.
df_new['GDP per ind'] = df_new['total GDP'] * 1e6 / df_new['population']
df_new

                 population     total GDP   GDP per ind
country
Argentina      3.733565e+07  2.950722e+05   7903.229085
Australia      1.905319e+07  5.418047e+05  28436.433261
India          1.006300e+09  1.728144e+06   1717.324719
Israel         6.114570e+06  1.292539e+05  21138.672749
Malawi         1.180150e+07  5.026222e+03    425.896679
South Africa   4.506410e+07  2.272424e+05   5042.647686
United States  2.821720e+08  9.898700e+06  35080.381854
Uruguay        3.219793e+06  2.525596e+04   7843.970620

In [26]:
# Conditional selection
df_new[ df_new['GDP per ind'] > 25000]

                population     total GDP   GDP per ind
country
Australia       19053186.0  5.418047e+05  28436.433261
United States  282171957.0  9.898700e+06  35080.381854

## Data Statistics

In [27]:
# Similar to series, you can use describe() to get statistics about your dataframe.
print(df_new.describe())

         population     total GDP   GDP per ind
count  8.000000e+00  8.000000e+00      8.000000
mean   1.763826e+08  1.606312e+06  13448.569581
std    3.479223e+08  3.397025e+06  13047.950117
min    3.219793e+06  5.026222e+03    425.896679
25%    1.037977e+07  1.032544e+05   4211.316944
50%    2.819442e+07  2.611573e+05   7873.599852
75%    1.043411e+08  8.383896e+05  22963.112877
max    1.006300e+09  9.898700e+06  35080.381854

Other functions to describe your data, like 

`df.mean()` 

`df.max()`

`df.std()`

## Data Grouping and Joining

In [28]:
# Groupby
df_fly = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                               'Parrot', 'Parrot'],
                    'Max Speed': [380., 370., 24., 26.]})
print(df_fly)
df_fly.groupby(['Animal']).mean()
df_fly.groupby(['Animal']).min()

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

        Max Speed
Animal
Falcon      370.0
Parrot       24.0

In [ ]:
#Append
df_fly = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                               'Parrot', 'Parrot'],
                    'Max Speed': [380., 370., 24., 26.]})
df_fly2 = pd.DataFrame({'Animal': ['Swan', 'Swan',
                               'Butterfly', 'Butterfly'],
                    'Max Speed': [100., 100., 4., 5.]})
print(df_fly)
print(df_fly2)
df_fly_all = df_fly.append(df_fly2)
df_fly_all
#df_fly_all.reset_index(drop = True)

In [ ]:
df_fly4 = pd.DataFrame({'Animal': ['Falcon', 'Parrot',  'Swan', 
                               'Butterfly'],
                    'Color': ['Brown', 'Green', 'White', 'Yellow']})
print(df_fly_all)
print(df_fly4)
df_fly_all.set_index('Animal').join(df_fly4.set_index('Animal'), on = 'Animal')